Revit 2026 API

# ElementCategory Property

---

Retrieves a Category object that represents the category or sub category in which the element resides.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public Category Category { get; }
```
```vb
Public ReadOnly Property Category As Category
	Get
```
```cpp
public:
property Category^ Category {
	Category^ get ();
}
```
```fsharp
member Category : Category with get
```

#### Property Value

Category

All category objects can be retrieved from the application by using the Categories property of the Application.Settings object.

#### Reference

Element Class

Autodesk.Revit.DB Namespace